---
kind: method
id: M:Autodesk.Revit.DB.HermiteSplineTangents.#ctor
source: html/4a4e5172-7176-f992-a3f0-e9b1f8071005.htm
---
# Autodesk.Revit.DB.HermiteSplineTangents.#ctor Method

Constructs a new default instance of the class, with tangent vectors uninitialized.

## Syntax (C#)
```csharp
public HermiteSplineTangents()
```